tests/perf/history_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="History API SLO" enabled="true">
      <stringProp name="TestPlan.comments">APPT-036: p95 &lt; 2000ms @ 100 users</stringProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_URL" elementType="Argument"><stringProp name="Argument.value">http://localhost:5239</stringProp></elementProp>
          <elementProp name="PATIENT_ID" elementType="Argument"><stringProp name="Argument.value">P123</stringProp></elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="100 Users 60s" enabled="true">
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">60</stringProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /api/appointments/history" enabled="true">
          <stringProp name="HTTPSampler.domain">${__BeanShell(${BASE_URL}.replace('http://','').replace('https://','').split(':')[0])}</stringProp>
          <stringProp name="HTTPSampler.port">${__BeanShell(${BASE_URL}.split(':').length&gt;2?${BASE_URL}.split(':')[2].split('/')[0]:'80')}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/appointments/history</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="patientId" elementType="HTTPArgument"><stringProp name="Argument.value">${PATIENT_ID}</stringProp></elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>